//! Авторы похожих решений (основанных на манипуляциях со строками):
//! * Ткачёв Захар
//! * Торяник Георгий
//!
//! Авторы оптимальных решений в числах:
//! * Першина Настя
//! * Лысуха Виталий
//! * Момот Олег

fn main() {
    let mut line = String::new();
    std::io::stdin().read_line(&mut line).unwrap();
    let answer = line
        .trim()
        // "12300"
        .chars()
        // ['1', '2', '3', '0', '0']
        .rev()
        // ['0', '0', '3', '2', '1']
        .skip_while(|x| *x == '0')
        // ['3', '2', '1']
        .collect::<String>();
    // "321"
    println!("{}", answer);
}
